; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s3-p12-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 l4-0 l4-1 l4-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (at t0 l0-1)
    (at t1 l1-0)
    (at t2 l2-1)
    (at t3 l3-2)
    (at t4 l4-0)
    (at p0 l2-2)
    (at p1 l4-2)
    (at p2 l3-0)
    (at p3 l1-2)
    (at p4 l2-2)
    (at p5 l4-2)
    (at p6 l4-1)
    (at p7 l2-0)
    (at p8 l2-2)
    (at p9 l3-0)
    (at p10 l0-1)
    (at p11 l1-2)
    (at a0 l2-0)
    (at a1 l1-0)
    (at a2 l2-0)
    (at a3 l4-0)
)
(:goal
    (and
        (at p0 l4-1)
        (at p1 l2-2)
        (at p2 l4-0)
        (at p3 l2-0)
        (at p4 l1-1)
        (at p5 l1-1)
        (at p6 l2-2)
        (at p7 l4-1)
        (at p8 l1-2)
        (at p9 l1-1)
        (at p10 l1-2)
        (at p11 l0-2)
    )
)

  (:constraints
    (always (not (at p0 l0-0)))
  )
)

; plan
1. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 0 of 12
2. (load-airplane p7 a0 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 a0)
   goals met: 0 of 12
3. (load-truck p10 t0 l0-1)
   deleted: (at p10 l0-1)
   added: (in p10 t0)
   goals met: 0 of 12
4. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 0 of 12
5. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 0 of 12
6. (fly-airplane a2 l2-0 l4-0)
   deleted: (at a2 l2-0)
   added: (at a2 l4-0)
   goals met: 0 of 12
7. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 0 of 12
8. (load-truck p8 t2 l2-2)
   deleted: (at p8 l2-2)
   added: (in p8 t2)
   goals met: 0 of 12
9. (load-truck p4 t2 l2-2)
   deleted: (at p4 l2-2)
   added: (in p4 t2)
   goals met: 0 of 12
10. (load-truck p0 t2 l2-2)
   deleted: (at p0 l2-2)
   added: (in p0 t2)
   goals met: 0 of 12
11. (load-truck p5 t4 l4-2)
   deleted: (at p5 l4-2)
   added: (in p5 t4)
   goals met: 0 of 12
12. (load-truck p1 t4 l4-2)
   deleted: (at p1 l4-2)
   added: (in p1 t4)
   goals met: 0 of 12
13. (load-truck p3 t1 l1-2)
   deleted: (at p3 l1-2)
   added: (in p3 t1)
   goals met: 0 of 12
14. (load-truck p11 t1 l1-2)
   deleted: (at p11 l1-2)
   added: (in p11 t1)
   goals met: 0 of 12
15. (drive-truck t4 l4-2 l4-1 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-1)
   goals met: 0 of 12
16. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 0 of 12
17. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 0 of 12
18. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 0 of 12
19. (load-truck p6 t4 l4-1)
   deleted: (at p6 l4-1)
   added: (in p6 t4)
   goals met: 0 of 12
20. (unload-truck p8 t2 l2-0)
   deleted: (in p8 t2)
   added: (at p8 l2-0)
   goals met: 0 of 12
21. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 0 of 12
22. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 0 of 12
23. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 0 of 12
24. (unload-truck p11 t1 l1-0)
   deleted: (in p11 t1)
   added: (at p11 l1-0)
   goals met: 0 of 12
25. (unload-truck p10 t0 l0-0)
   deleted: (in p10 t0)
   added: (at p10 l0-0)
   goals met: 0 of 12
26. (load-airplane p8 a0 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a0)
   goals met: 0 of 12
27. (load-airplane p4 a0 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a0)
   goals met: 0 of 12
28. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 0 of 12
29. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 12
30. (load-airplane p3 a1 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a1)
   goals met: 0 of 12
31. (load-airplane p11 a1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a1)
   goals met: 0 of 12
32. (unload-truck p6 t4 l4-0)
   deleted: (in p6 t4)
   added: (at p6 l4-0)
   goals met: 0 of 12
33. (unload-truck p5 t4 l4-0)
   deleted: (in p5 t4)
   added: (at p5 l4-0)
   goals met: 0 of 12
34. (unload-truck p1 t4 l4-0)
   deleted: (in p1 t4)
   added: (at p1 l4-0)
   goals met: 0 of 12
35. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 0 of 12
36. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 0 of 12
37. (unload-airplane p7 a0 l4-0)
   deleted: (in p7 a0)
   added: (at p7 l4-0)
   goals met: 0 of 12
38. (unload-airplane p0 a0 l4-0)
   deleted: (in p0 a0)
   added: (at p0 l4-0)
   goals met: 0 of 12
39. (unload-airplane p3 a1 l2-0)
   deleted: (in p3 a1)
   added: (at p3 l2-0)
   goals met: 1 of 12
40. (load-airplane p6 a2 l4-0)
   deleted: (at p6 l4-0)
   added: (in p6 a2)
   goals met: 1 of 12
41. (load-airplane p5 a3 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 a3)
   goals met: 1 of 12
42. (load-airplane p1 a3 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 a3)
   goals met: 1 of 12
43. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 1 of 12
44. (load-truck p7 t4 l4-0)
   deleted: (at p7 l4-0)
   added: (in p7 t4)
   goals met: 1 of 12
45. (load-truck p0 t4 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 t4)
   goals met: 1 of 12
46. (fly-airplane a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 1 of 12
47. (fly-airplane a2 l4-0 l2-0)
   deleted: (at a2 l4-0)
   added: (at a2 l2-0)
   goals met: 1 of 12
48. (fly-airplane a3 l4-0 l3-0)
   deleted: (at a3 l4-0)
   added: (at a3 l3-0)
   goals met: 1 of 12
49. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 1 of 12
50. (unload-airplane p8 a0 l1-0)
   deleted: (in p8 a0)
   added: (at p8 l1-0)
   goals met: 1 of 12
51. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 1 of 12
52. (unload-airplane p11 a1 l0-0)
   deleted: (in p11 a1)
   added: (at p11 l0-0)
   goals met: 1 of 12
53. (unload-airplane p6 a2 l2-0)
   deleted: (in p6 a2)
   added: (at p6 l2-0)
   goals met: 1 of 12
54. (load-airplane p9 a3 l3-0)
   deleted: (at p9 l3-0)
   added: (in p9 a3)
   goals met: 1 of 12
55. (load-airplane p2 a3 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 a3)
   goals met: 1 of 12
56. (load-airplane p10 a1 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a1)
   goals met: 1 of 12
57. (unload-truck p7 t4 l4-1)
   deleted: (in p7 t4)
   added: (at p7 l4-1)
   goals met: 2 of 12
58. (unload-truck p0 t4 l4-1)
   deleted: (in p0 t4)
   added: (at p0 l4-1)
   goals met: 3 of 12
59. (load-truck p11 t0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 t0)
   goals met: 3 of 12
60. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 3 of 12
61. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 3 of 12
62. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 3 of 12
63. (fly-airplane a3 l3-0 l2-0)
   deleted: (at a3 l3-0)
   added: (at a3 l2-0)
   goals met: 3 of 12
64. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 3 of 12
65. (unload-airplane p10 a1 l1-0)
   deleted: (in p10 a1)
   added: (at p10 l1-0)
   goals met: 3 of 12
66. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 3 of 12
67. (unload-airplane p1 a3 l2-0)
   deleted: (in p1 a3)
   added: (at p1 l2-0)
   goals met: 3 of 12
68. (unload-truck p8 t1 l1-2)
   deleted: (in p8 t1)
   added: (at p8 l1-2)
   goals met: 4 of 12
69. (unload-truck p11 t0 l0-2)
   deleted: (in p11 t0)
   added: (at p11 l0-2)
   goals met: 5 of 12
70. (load-truck p6 t2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 t2)
   goals met: 5 of 12
71. (fly-airplane a3 l2-0 l1-0)
   deleted: (at a3 l2-0)
   added: (at a3 l1-0)
   goals met: 5 of 12
72. (load-truck p1 t2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 5 of 12
73. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 5 of 12
74. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 5 of 12
75. (unload-airplane p9 a3 l1-0)
   deleted: (in p9 a3)
   added: (at p9 l1-0)
   goals met: 5 of 12
76. (unload-airplane p5 a3 l1-0)
   deleted: (in p5 a3)
   added: (at p5 l1-0)
   goals met: 5 of 12
77. (unload-truck p4 t1 l1-1)
   deleted: (in p4 t1)
   added: (at p4 l1-1)
   goals met: 6 of 12
78. (fly-airplane a3 l1-0 l4-0)
   deleted: (at a3 l1-0)
   added: (at a3 l4-0)
   goals met: 6 of 12
79. (unload-truck p6 t2 l2-2)
   deleted: (in p6 t2)
   added: (at p6 l2-2)
   goals met: 7 of 12
80. (unload-truck p1 t2 l2-2)
   deleted: (in p1 t2)
   added: (at p1 l2-2)
   goals met: 8 of 12
81. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 8 of 12
82. (unload-airplane p2 a3 l4-0)
   deleted: (in p2 a3)
   added: (at p2 l4-0)
   goals met: 9 of 12
83. (load-truck p9 t1 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 t1)
   goals met: 9 of 12
84. (load-truck p5 t1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 9 of 12
85. (load-truck p10 t1 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 t1)
   goals met: 9 of 12
86. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 9 of 12
87. (unload-truck p10 t1 l1-2)
   deleted: (in p10 t1)
   added: (at p10 l1-2)
   goals met: 10 of 12
88. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 10 of 12
89. (unload-truck p9 t1 l1-1)
   deleted: (in p9 t1)
   added: (at p9 l1-1)
   goals met: 11 of 12
90. (unload-truck p5 t1 l1-1)
   deleted: (in p5 t1)
   added: (at p5 l1-1)
   goals met: 12 of 12
